const postList = [
  {
    id: 1,
    title: "녹색 하나 찾아볼 수 없던 곳에 창업을 하다.",
    content:
      " 한 청년 사장 김성민은 녹색 산업에 대한 열정과 관심으로 '바다와 함께'라는 독특한 비전으로 녹색 창업을 시작했습니다. 그의 이야기는 지속 가능한 사업 모델과 창의적 사고의 중요성을 강조하며, 환경 보호와 더 나은 미래를 위한 노력을 이야기합니다. \n\n '바다와 함께'는 해양 쓰레기 문제와 해양 오염 문제를 해결하는 사업으로, 환경 친화적이고 지속 가능한 제품과 서비스를 제공합니다. 김성민 사장은 재생 가능한 자원을 사용하여 제품을 만들고, 분해 가능한 소재를 활용하여 자연을 보호하고 있습니다. \n\n 그러나 김성민 사장은 시작부터 쉽지 않았습니다. 초기 투자 유치와 사업 확장에 어려움을 겪었지만, 끈기와 비전으로 투자를 유치하고 사업을 성공시키는 데 성공했습니다. \n\n 김성민 사장은 소비자들의 인식과 태도 변화를 이끌어내는 데에도 주력했습니다. 녹색 산업의 개념과 제품의 환경적 이점을 소비자들에게 알리고, 더 나은 선택을 할 수 있도록 지원하고 있습니다. \n\n 마지막으로, 김성민 사장은 젊은 창업가들에게 혁신과 지속 가능성을 추구하도록 조언합니다. 녹색 산업은 미래를 이끄는 중요한 분야이며, 우리는 환경을 보호하고 더 나은 미래를 위해 노력해야 합니다. \n\n 김성민 사장의 '바다와 함께'라는 창업 이야기는 우리에게 큰 영감을 줍니다. 그의 녹색 창업은 현대 사회의 필요성을 반영하며, 더 나은 미래를 위한 희망과 열정을 안겨줍니다. 우리는 그의 사업이 지속적으로 성장하고, 녹색 산업의 선구자로서 더 많은 사람들에게 영감을 전할 수 있기를 기대합니다.",
    sub: "The greatest glory in living lies not in never falling, but in rising every time we fall. \n – Nelson Mandela",
    createDate: "20 / 08 / 25",
    readCount: 6,
  },
  {
    id: 2,
    title: "What’s in my bag? do they harm the earth ",
    content:
      "안녕하세요, 여러분! 오늘은 함께 내 가방 안에 들어있는 물건들과 그것들이 지구에 미치는 영향에 대해 이야기해보려고 합니다. \n\n 가방은 우리 일상 생활에서 필수적인 아이템 중 하나입니다. 하지만 가방 안에는 종종 생각지 못한 환경적 영향을 미치는 물건들이 들어있을 수 있습니다. 가방 속에는 주로 노트북, 핸드폰, 지갑, 휴대용 물병, 화장품 등이 들어가며 이들이 환경에 어떤 영향을 미치는지 살펴보겠습니다. \n\n 노트북과 핸드폰: 전자제품은 생산과 폐기 과정에서 많은 에너지와 자원을 소비합니다. 장기적으로 볼 때, 전자제품 소비를 줄이고 오래 사용하는 것이 환경에 도움이 됩니다. \n\n 지갑: 가죽 지갑은 가축의 가죽을 사용하며 가죽 생산은 메탄 배출과 비료 사용으로 인해 온실가스를 발생시킬 수 있습니다. 대안으로 지속 가능한 재료로 만든 지갑을 선택하는 것이 친환경적입니다. \n\n 휴대용 물병: 일회용 플라스틱 물병의 사용은 플라스틱 폐기물 문제를 야기하며 해양 생태계에 위협을 줄 수 있습니다. 재사용 가능한 금속 또는 유리 물병을 사용하여 플라스틱 사용을 최소화합시다. \n\n화장품: 일부 화장품에는 화학 성분이 많이 들어있을 수 있으며, 이러한 화학 물질은 수질 오염과 생태계에 영향을 미칠 수 있습니다. 환경 친화적인 천연 화장품을 고려해보세요. \n\n 이외에도 가방 안에는 다양한 물건들이 들어갈 수 있습니다. 이 물건들이 지구에 미치는 영향을 고려하여 환경에 더욱 책임감 있게 선택하는 것이 중요합니다. 간단한 노력으로도 지구를 보호하고 더 건강한 환경을 만들 수 있습니다. \n\n 우리 모두가 지구 환경을 위해 더 나은 선택을 하고, 지속 가능한 소비 습관을 가지기를 희망합니다. 함께 작은 실천을 통해 큰 변화를 이루어냅시다. 감사합니다!",
    sub: "지구는 우리가 빌려온 것이 아니라 우리가 빌려준 것입니다. \n\n - 데이비드 브로우어",
    createDate: "20 / 09 / 01",
    readCount: 5,
  },
  {
    id: 3,
    title: "이 물건을 구매하면 놀라운 변화가 일어난다고?",
    content:
      "안녕하세요, 여러분! 저희 뉴스레터에 오신 것을 환영합니다. 오늘은 환경과 지구를 보호하는 데 도움이 되는 놀라운 변화를 가져올 수 있는 제품에 대해 이야기하려고 합니다. \n\n 재사용 가능한 금속 물병: 일회용 플라스틱 물병 대신 재사용 가능한 금속 물병을 구매하면 플라스틱 사용을 줄이고 해양 생태계에 미치는 영향을 최소화할 수 있습니다. 뿐만 아니라, 재사용 가능한 물병은 자원 절약과 온실가스 배출을 감소시키는 데도 기여합니다. \n\n 친환경 천연 화장품: 화학성분이 적은 친환경 천연 화장품을 사용하면 수질 오염과 생태계에 미치는 영향을 줄일 수 있습니다. 또한 화장품 회사들이 지속 가능한 재료와 생산 방식을 채택하도록 유도하는데 도움이 됩니다. \n\n 에코백: 일회용 플라스틱 봉투 대신 에코백을 사용하면 폐기물 감소와 자원 재활용을 장려할 수 있습니다. 작은 노력이지만 매일 사용하는 봉투의 양이 줄어들면 큰 변화가 있을 수 있습니다. \n\n 태양광 충전기: 전기를 태양광으로 충전할 수 있는 충전기를 사용하면 화석연료에 의한 에너지 소비를 줄일 수 있으며, 친환경적인 에너지를 사용하는 데 도움이 됩니다. \n\n 친환경 생활용품: 친환경적으로 생산된 생활용품을 선택하면 자원 절약과 환경 보호에 기여할 수 있습니다. 종이나 플라스틱 대신 재생지소재를 사용한 제품들을 구매해보세요. \n\n 이러한 제품들을 구매하고 사용함으로써 우리는 간단한 노력으로도 환경에 긍정적인 변화를 가져올 수 있습니다. 우리의 작은 선택이 지구의 미래를 위한 큰 도움이 되기를 기대합니다. 함께 지구를 지키는 책임감 있는 소비 습관을 만들어 나가요! 감사합니다.",
    sub: "작은 노력들이 모여 큰 변화를 이루어낼 수 있습니다. \n\n - 제인 굿 올",
    createDate: "21 / 02 / 11",
    readCount: 1,
  },
  {
    id: 4,
    title: "최초 인플루언서 창업자의 등장",
    content:
      "안녕하세요, 여러분! 오늘은 인스타그램 인플루언서이자 창업가인 최가령님과의 인터뷰를 진행했습니다. 그녀는 인스타그램을 통해 대중들에게 영감을 주고 동시에 창업을 통해 자신의 비전을 실현하고 있습니다. 그녀의 독특한 이야기와 경험을 들려드리겠습니다. \n\n 인터뷰 내용: \n\n Q: 안녕하세요, 최가령님! 자기소개 부탁드릴게요. 인스타그램에서 어떻게 인플루언서로 활동하시게 되었나요? \n\n A: 안녕하세요! 저는 최가령이라고 합니다. 인스타그램에서는 '@GaRyInFlUeNcEr'라는 닉네임으로 활동하고 있어요. 인플루언서로 활동을 시작한 것은 5년 전, 아주 우연한 기회로부터였습니다. 당시에는 미디어 관련 일을 하고 있었는데, 어느날 친구가 인스타그램을 추천해줬어요. 놀랍게도 제 사진과 콘텐츠가 꽤나 인기가 있었더라구요. \n\n  Q: 그렇군요! 인스타그램에서의 인기가 창업 아이디어로 이어진 건가요? \n\n  A: 네, 그렇습니다. 인스타그램을 통해 인기를 얻게 되면서 많은 브랜드들과 협업하게 되었습니다. 이때부터 브랜드와 소통하며 제가 즐기는 라이프 스타일과 함께 브랜드의 가치를 전달하고자 하는 생각이 들었어요. 그렇게 창업 아이디어가 떠올랐고, '미션플라스틱'이라는 친환경 제품 브랜드를 만들었습니다. \n\n Q: 미션플라스틱에 대해 자세히 설명해주실 수 있을까요? \n\n A: 물론입니다! 미션플라스틱은 환경 문제에 대한 인식을 높이고 해양 폐기물 문제에 대응하는 친환경 제품 브랜드입니다. 싱글 유스 플라스틱 사용을 최소화하고, 재생 가능한 자원으로 제작된 제품을 제공합니다. 특히 해변 청소 캠페인과 재활용 교육 프로그램을 진행하며 더 많은 사람들에게 환경 보호의 중요성을 알리고자 합니다.\n\n Q: 놀라운 비전과 목표입니다. 어떤 어려움과 도전을 극복하며 미션플라스틱을 발전시키고 있으신가요? \n\n A: 시작 단계에서는 자금 문제와 인식 부족 등 다양한 어려움이 있었습니다. 하지만 지속 가능한 제품을 만들어 가는 과정에서 끊임없는 노력과 투지를 갖추었고, 친환경 제품에 대한 소비자들의 관심이 높아짐에 따라 브랜드의 인지도와 판매량이 꾸준히 증가하고 있어요. \n\n Q: 미션플라스틱을 통해 전하는 메시지가 있다면 무엇인가요? \n\n A: 제가 전하고 싶은 메시지는, 작은 노력이라도 지구와 환경을 지킬 수 있다는 것입니다. 우리의 선택이 지구의 미래에 큰 영향을 미친다는 것을 잊지 말아주세요. 함께 손을 잡고 지구를 보호하는 노력들이 모여 더 큰 변화를 이루어낼 수 있을 거라 믿어요. \n\n 인터뷰를 통해 최가령님의 소중한 이야기를 들을 수 있어서 정말 감사합니다. 최가령님의 친환경 브랜드 미션플라스틱과 더 많은 분들에게 환경 보호의 중요성을 전달하는 데 성공하시기를 기원합니다. 함께 지구를 지켜나가는 노력들이 더욱 커지길 바라며, 감사합니다! \n\n이렇게 최가령님과 미션플라스틱에 대한 인터뷰글을 작성해보았습니다. 인플루언서로서 활동하며 친환경 브랜드를 창업하는 경험과 노력들이 놀라운 변화를 이끌어내는 예시가 될 수 있기를 바랍니다.",
    sub: "우리가 환경을 지키지 않으면 환경이 우리를 지켜주지 않습니다. \n\n - 노바카 라지나",
    createDate: "21 / 03 / 04",
    readCount: 2,
  },
  {
    id: 5,
    title: "세계에게 등돌려진 독성 식물의 대반전",
    content:
      "안녕하세요, 여러분! 뉴스레터에 오신 것을 환영합니다. 오늘은 세계적으로 등돌려진 독성 식물에 대한 놀라운 연구 결과를 전해드리고자 합니다. 최근의 연구에서는 이러한 독성 식물들이 미세플라스틱 감소에 기여할 수 있는 가능성을 발견하였습니다. \n\n  독성 식물은 일반적으로 인간에게 해로울 수 있어 무시되거나 버려지는 경우가 많았습니다. 하지만 최근의 연구에서는 이러한 독성 식물들이 환경 문제를 해결하는 데 큰 역할을 할 수 있음을 발견하였습니다. 특히 미세플라스틱 감소에 기여하는 놀라운 효과를 보였습니다. \n\n 연구팀은 독성 식물의 뿌리 부분을 분석하여 미세플라스틱 농도를 측정하였습니다. 결과적으로, 이러한 식물들은 미세플라스틱을 자연적으로 분해하는 데 도움이 된다는 것을 확인하였습니다. 식물의 뿌리는 토양 속에서 미세플라스틱을 분해하고, 토양과 물에 더 이상의 오염을 방지하는 역할을 수행합니다. \n\n 이 연구 결과는 환경 보호와 지속 가능성에 대한 높은 관심을 갖는 시기에 큰 의미를 가지며, 미세플라스틱 문제에 대한 대응 방안으로서 독성 식물들을 적극적으로 활용할 수 있는 가능성을 제시하고 있습니다. \n\n 미세플라스틱은 바다, 강, 토양 등 여러 환경에서 발견되고 있으며, 그 영향력이 크게 걱정되고 있습니다. 이러한 연구 결과를 토대로 독성 식물을 보호하고, 미세플라스틱을 감소시키는 데 활용하는 것은 지구 환경을 보호하는 데 큰 기여가 될 수 있습니다. \n\n 세계적으로 등돌려진 독성 식물들이 환경 문제 해결의 열쇠가 될 수 있음을 알리며, 더 많은 연구와 지속적인 노력이 이어져야 함을 강조하고자 합니다. 환경 문제에 대한 우리 모두의 책임과 협력이 더욱 중요한 시점입니다. \n\n 지구 환경을 보호하고 미세플라스틱 감소에 기여할 수 있는 놀라운 가능성을 보여준 이러한 연구를 기반으로, 미래를 위해 지속 가능한 선택과 노력들이 더욱 중요하다는 점을 다시 한번 깊이 고려해보시기를 부탁드립니다. \n\n 감사합니다! \n\n 이렇게 놀라운 연구 결과에 대한 뉴스레터 글을 작성해보았습니다. 독성 식물들이 미세플라스틱 감소에 기여할 수 있는 가능성은 환경 보호에 대한 새로운 관점을 제시하고, 미세플라스틱 문제에 대한 대응 방안으로서 유망한 발견입니다. 지구 환경을 보호하는 데 더 많은 관심과 노력이 필요한 시기이므로, 이러한 연구를 토대로 우리 모두가 지구를 보호하는 데 기여할 수 있기를 바랍니다.",
    sub: "지구를 가꾸는 것은 미래를 키우는 것입니다. \n\n 제레미 그란트",
    createDate: "20 / 08 / 25",
    readCount: 4,
  },
  {
    id: 6,
    title: "벌레 먹은 목화솜의 재발견",
    content:
      "안녕하세요! 저는 초등학교 탐구대회에서 우승을 차지한 지민이라고 해요. 오늘은 제가 우승한 연구 주제인 '벌레 먹은 목화솜의 재발견'에 대해 기쁨과 설렘으로 일기를 써볼게요. \n\n 우승하고서부터 지금까지 정말 행복한 기분이에요. 오늘은 제가 시작한 연구 주제가 얼마나 특별하고 의미 있는지 느끼게 되었습니다. 처음에는 조금 겁이 났지만, 학교 선생님과 부모님들이 늘 응원해주시고, 친구들과 함께 더욱 흥미롭게 연구할 수 있었습니다. \n\n 이번 연구는 꼬마 벌레들이 목화솜을 먹는 것을 알아낸 후, 이들이 나무와 식물의 성장에 어떤 영향을 미치는지 궁금증에서 시작되었어요. 함께 친구들과 식물 성장 실험을 하면서 벌레들이 어떻게 도움이 되는지 알게 되었어요. 그들이 먹은 목화솜이 비료처럼 식물에 유익하게 작용하는 걸 확인할 수 있었죠! \n\n 우리의 탐구 결과는 놀라운 사실을 밝혀냈어요. 벌레들이 먹은 목화솜이 나무와 식물의 성장을 촉진하는 데 도움이 된다는 것이었어요. 이것이 우리의 지구와 환경에 어떻게 긍정적인 영향을 미칠 수 있는지 상상만 해도 설레이더라구요! \n\n 우리 연구는 시상식에서 다른 친구들과 함께 상을 받을 수 있었어요. 모두들 열심히 연구하고 노력한 보람이 있었습니다. 이제부터는 더 많은 사람들이 환경을 생각하고 지구를 보호하는 데 기여할 수 있기를 바라요. \n\n 내일은 학교에서 우승을 축하해줄 거에요. 가족과 함께 기뻐할 시간이 될 것 같아요. 앞으로도 더 많은 흥미로운 탐구와 연구를 해보고 싶어요. 지구를 지키는 데에는 작은 노력이라도 큰 변화를 이룰 수 있다는 것을 알게 된 하루였어요. 앞으로도 환경과 지구를 생각하는 소중한 연구를 이어나가고 싶어요. \n\n 감사합니다! 또 열심히 하겠습니다! \n\n 지민 올림",
    sub: "우리는 지구에 살기 위해 자연에 의존합니다. 자연은 우리에게 의지하지 않습니다. \n\n - 안토니오 그라마시",
    createDate: "20 / 08 / 25",
    readCount: 4,
  },
];

const getPostByNo = (id) => {
  const array = postList.filter((x) => x.id == id);
  if (array.length == 1) {
    return array[0];
  }
  return null;
};

export { postList, getPostByNo };
